详情结果/原始结果/scylla3_runD.txt
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl com.yahoo.ycsb:cassandra-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
java -cp /home/YCSB/cassandra/conf:/home/YCSB/cassandra/target/cassandra-binding-0.15.0.jar:/root/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/root/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/root/.m2/repository/io/dropwizard/metrics/metrics-core/3.1.2/metrics-core-3.1.2.jar:/root/.m2/repository/com/datastax/cassandra/cassandra-driver-core/3.0.0/cassandra-driver-core-3.0.0.jar:/root/.m2/repository/io/netty/netty-handler/4.0.33.Final/netty-handler-4.0.33.Final.jar:/root/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/home/YCSB/core/target/core-0.15.0.jar:/root/.m2/repository/org/slf4j/slf4j-api/1.7.25/slf4j-api-1.7.25.jar:/root/.m2/repository/io/netty/netty-transport/4.0.33.Final/netty-transport-4.0.33.Final.jar:/root/.m2/repository/io/netty/netty-codec/4.0.33.Final/netty-codec-4.0.33.Final.jar:/root/.m2/repository/com/google/guava/guava/16.0.1/guava-16.0.1.jar:/root/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/root/.m2/repository/io/netty/netty-buffer/4.0.33.Final/netty-buffer-4.0.33.Final.jar:/root/.m2/repository/io/netty/netty-common/4.0.33.Final/netty-common-4.0.33.Final.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.CassandraCQLClient -s -P workloads/workloadd -p hosts=192.168.4.134 -p port=9042 -p cassandra.keyspace=ycsb -p cassandra.username=cassandra -p cassandra.password=cassandra -threads 100 -t
Command line: -db com.yahoo.ycsb.db.CassandraCQLClient -s -P workloads/workloadd -p hosts=192.168.4.134 -p port=9042 -p cassandra.keyspace=ycsb -p cassandra.username=cassandra -p cassandra.password=cassandra -threads 100 -t
YCSB Client 0.15.0

Loading workload...
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
2018-12-29 14:47:40:671 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2018-12-29 14:47:50:643 10 sec: 114713 operations; 11471.3 current ops/sec; est completion in 14 minutes [READ: Count=109125, Max=87999, Min=2312, Avg=8216.5, 90=10439, 99=19407, 99.9=29039, 99.99=84031] [INSERT: Count=5604, Max=78783, Min=3044, Avg=8531.34, 90=10527, 99=13895, 99.9=21263, 99.99=71935] 
2018-12-29 14:48:00:642 20 sec: 237559 operations; 12284.6 current ops/sec; est completion in 13 minutes [READ: Count=116796, Max=34463, Min=1687, Avg=8117.88, 90=10319, 99=18831, 99.9=24895, 99.99=29359] [INSERT: Count=6038, Max=16607, Min=4080, Avg=8522.76, 90=10559, 99=12975, 99.9=15143, 99.99=16255] 
2018-12-29 14:48:10:642 30 sec: 359026 operations; 12146.7 current ops/sec; est completion in 13 minutes [READ: Count=115356, Max=33279, Min=2682, Avg=8214.75, 90=10479, 99=19087, 99.9=24799, 99.99=29039] [INSERT: Count=6107, Max=15247, Min=3284, Avg=8565.33, 90=10551, 99=12647, 99.9=14055, 99.99=14591] 
2018-12-29 14:48:20:642 40 sec: 485568 operations; 12654.2 current ops/sec; est completion in 13 minutes [READ: Count=120334, Max=34943, Min=2148, Avg=7878.7, 90=9863, 99=18335, 99.9=23775, 99.99=27871] [INSERT: Count=6212, Max=15983, Min=3246, Avg=8323.78, 90=10119, 99=12463, 99.9=13959, 99.99=15375] 
2018-12-29 14:48:30:642 50 sec: 608171 operations; 12260.3 current ops/sec; est completion in 12 minutes [READ: Count=116504, Max=33439, Min=2506, Avg=8133.83, 90=10335, 99=18735, 99.9=24591, 99.99=29599] [INSERT: Count=6095, Max=14959, Min=4404, Avg=8549.67, 90=10471, 99=12839, 99.9=14255, 99.99=14711] 
2018-12-29 14:48:40:642 60 sec: 730621 operations; 12245 current ops/sec; est completion in 12 minutes [READ: Count=116292, Max=34079, Min=3086, Avg=8145.74, 90=10335, 99=19055, 99.9=24559, 99.99=29199] [INSERT: Count=6163, Max=16047, Min=3732, Avg=8507.52, 90=10487, 99=12647, 99.9=15063, 99.99=16015] 
2018-12-29 14:48:50:642 70 sec: 852051 operations; 12143 current ops/sec; est completion in 12 minutes [READ: Count=115190, Max=38879, Min=2218, Avg=8213.4, 90=10359, 99=18991, 99.9=24671, 99.99=29983] [INSERT: Count=6235, Max=18559, Min=3994, Avg=8591.9, 90=10615, 99=12695, 99.9=14543, 99.99=15511] 
2018-12-29 14:49:00:642 80 sec: 977007 operations; 12495.6 current ops/sec; est completion in 12 minutes [READ: Count=118745, Max=36191, Min=3002, Avg=7982.79, 90=10159, 99=18431, 99.9=24303, 99.99=29279] [INSERT: Count=6216, Max=17439, Min=3874, Avg=8391.36, 90=10311, 99=12703, 99.9=15375, 99.99=17375] 
2018-12-29 14:49:10:642 90 sec: 1100257 operations; 12325 current ops/sec; est completion in 12 minutes [READ: Count=117194, Max=35519, Min=2662, Avg=8094.32, 90=10351, 99=18767, 99.9=24623, 99.99=29551] [INSERT: Count=6067, Max=17391, Min=3772, Avg=8455.15, 90=10447, 99=12735, 99.9=15223, 99.99=15791] 
2018-12-29 14:49:20:643 100 sec: 1224473 operations; 12421.6 current ops/sec; est completion in 11 minutes [READ: Count=117952, Max=34559, Min=2518, Avg=8029.53, 90=10167, 99=18735, 99.9=24351, 99.99=29279] [INSERT: Count=6250, Max=15327, Min=3564, Avg=8416.91, 90=10351, 99=12927, 99.9=14767, 99.99=15095] 
2018-12-29 14:49:30:642 110 sec: 1349450 operations; 12497.7 current ops/sec; est completion in 11 minutes [READ: Count=118751, Max=42623, Min=2944, Avg=7979.15, 90=10151, 99=18527, 99.9=24607, 99.99=30111] [INSERT: Count=6248, Max=19567, Min=3968, Avg=8373.41, 90=10327, 99=13247, 99.9=15663, 99.99=17983] 
2018-12-29 14:49:40:642 120 sec: 1473180 operations; 12373 current ops/sec; est completion in 11 minutes [READ: Count=117503, Max=36575, Min=3102, Avg=8061.28, 90=10343, 99=18607, 99.9=24847, 99.99=30847] [INSERT: Count=6225, Max=16007, Min=3144, Avg=8452.56, 90=10447, 99=12887, 99.9=14791, 99.99=15287] 
2018-12-29 14:49:50:642 130 sec: 1595891 operations; 12271.1 current ops/sec; est completion in 11 minutes [READ: Count=116485, Max=38527, Min=2614, Avg=8128.3, 90=10375, 99=18943, 99.9=24495, 99.99=29999] [INSERT: Count=6208, Max=17567, Min=3802, Avg=8514.58, 90=10575, 99=12999, 99.9=15039, 99.99=17279] 
2018-12-29 14:50:00:642 140 sec: 1719646 operations; 12375.5 current ops/sec; est completion in 11 minutes [READ: Count=117352, Max=34655, Min=2526, Avg=8057.9, 90=10247, 99=18799, 99.9=24815, 99.99=29071] [INSERT: Count=6399, Max=16127, Min=3982, Avg=8455.86, 90=10399, 99=12935, 99.9=15479, 99.99=15935] 
2018-12-29 14:50:10:642 150 sec: 1845218 operations; 12557.2 current ops/sec; est completion in 11 minutes [READ: Count=119309, Max=120127, Min=1963, Avg=7946.09, 90=10135, 99=18751, 99.9=32687, 99.99=93951] [INSERT: Count=6270, Max=16415, Min=2354, Avg=8266.66, 90=10247, 99=12543, 99.9=14471, 99.99=16231] 
2018-12-29 14:50:20:642 160 sec: 1970296 operations; 12507.8 current ops/sec; est completion in 10 minutes [READ: Count=118772, Max=37599, Min=2926, Avg=7972.09, 90=10111, 99=18495, 99.9=24479, 99.99=28863] [INSERT: Count=6299, Max=17727, Min=3934, Avg=8414.51, 90=10351, 99=12871, 99.9=15231, 99.99=16943] 
2018-12-29 14:50:30:642 170 sec: 2093183 operations; 12288.7 current ops/sec; est completion in 10 minutes [READ: Count=116857, Max=36415, Min=2730, Avg=8115.52, 90=10279, 99=18847, 99.9=24255, 99.99=27807] [INSERT: Count=6030, Max=15687, Min=4132, Avg=8519.42, 90=10511, 99=12687, 99.9=14239, 99.99=15255] 
2018-12-29 14:50:40:642 180 sec: 2216779 operations; 12359.6 current ops/sec; est completion in 10 minutes [READ: Count=117436, Max=33279, Min=2890, Avg=8073.19, 90=10231, 99=18815, 99.9=24511, 99.99=29103] [INSERT: Count=6160, Max=15951, Min=3610, Avg=8435.19, 90=10295, 99=12543, 99.9=14311, 99.99=15871] 
2018-12-29 14:50:50:642 190 sec: 2340771 operations; 12399.2 current ops/sec; est completion in 10 minutes [READ: Count=117786, Max=35295, Min=2714, Avg=8043.23, 90=10199, 99=18607, 99.9=24239, 99.99=28831] [INSERT: Count=6207, Max=16207, Min=3868, Avg=8427.22, 90=10351, 99=12535, 99.9=14343, 99.99=15471] 
2018-12-29 14:51:00:642 200 sec: 2462664 operations; 12189.3 current ops/sec; est completion in 10 minutes [READ: Count=115892, Max=35487, Min=3042, Avg=8180.96, 90=10511, 99=18927, 99.9=25135, 99.99=29055] [INSERT: Count=6002, Max=17935, Min=4112, Avg=8591.89, 90=10751, 99=13327, 99.9=15831, 99.99=16927] 
2018-12-29 14:51:10:642 210 sec: 2583608 operations; 12094.4 current ops/sec; est completion in 10 minutes [READ: Count=114987, Max=32991, Min=2518, Avg=8249.03, 90=10687, 99=19135, 99.9=25807, 99.99=30959] [INSERT: Count=5956, Max=17583, Min=3714, Avg=8604.92, 90=10783, 99=13383, 99.9=15719, 99.99=16783] 
2018-12-29 14:51:20:642 220 sec: 2708154 operations; 12454.6 current ops/sec; est completion in 9 minutes [READ: Count=118382, Max=34623, Min=2876, Avg=8006.43, 90=10191, 99=18495, 99.9=24543, 99.99=29855] [INSERT: Count=6165, Max=16559, Min=4140, Avg=8454.03, 90=10407, 99=12783, 99.9=14623, 99.99=16311] 
2018-12-29 14:51:30:642 230 sec: 2832182 operations; 12402.8 current ops/sec; est completion in 9 minutes [READ: Count=117870, Max=34879, Min=2452, Avg=8042.63, 90=10287, 99=18527, 99.9=24607, 99.99=30751] [INSERT: Count=6160, Max=16767, Min=4058, Avg=8407.77, 90=10431, 99=13103, 99.9=15431, 99.99=16735] 
2018-12-29 14:51:40:642 240 sec: 2955342 operations; 12316 current ops/sec; est completion in 9 minutes [READ: Count=116939, Max=38111, Min=2862, Avg=8100.42, 90=10335, 99=18671, 99.9=24751, 99.99=30159] [INSERT: Count=6226, Max=15831, Min=3852, Avg=8442.17, 90=10391, 99=12727, 99.9=14751, 99.99=15503] 
2018-12-29 14:51:50:642 250 sec: 3075618 operations; 12027.6 current ops/sec; est completion in 9 minutes [READ: Count=114171, Max=39967, Min=2980, Avg=8293.66, 90=10647, 99=19215, 99.9=25359, 99.99=32831] [INSERT: Count=6098, Max=18223, Min=4168, Avg=8687.89, 90=10791, 99=13199, 99.9=15911, 99.99=18127] 
2018-12-29 14:52:00:642 260 sec: 3195141 operations; 11952.3 current ops/sec; est completion in 9 minutes [READ: Count=113517, Max=32959, Min=2762, Avg=8347.3, 90=10559, 99=19135, 99.9=24687, 99.99=28831] [INSERT: Count=6013, Max=15511, Min=4168, Avg=8701.92, 90=10703, 99=12935, 99.9=15047, 99.99=15495] 
2018-12-29 14:52:10:642 270 sec: 3315473 operations; 12033.2 current ops/sec; est completion in 9 minutes [READ: Count=114372, Max=38399, Min=3032, Avg=8290.76, 90=10543, 99=18959, 99.9=25199, 99.99=31135] [INSERT: Count=5959, Max=16527, Min=3742, Avg=8653.28, 90=10655, 99=13007, 99.9=14703, 99.99=15407] 
2018-12-29 14:52:20:642 280 sec: 3437355 operations; 12188.2 current ops/sec; est completion in 8 minutes [READ: Count=115834, Max=85247, Min=2518, Avg=8184.53, 90=10415, 99=19119, 99.9=28879, 99.99=63775] [INSERT: Count=6040, Max=16975, Min=3960, Avg=8532.47, 90=10519, 99=13215, 99.9=14999, 99.99=16959] 
2018-12-29 14:52:30:642 290 sec: 3559869 operations; 12251.4 current ops/sec; est completion in 8 minutes [READ: Count=116376, Max=35647, Min=2702, Avg=8140.85, 90=10383, 99=18687, 99.9=24879, 99.99=28735] [INSERT: Count=6145, Max=15799, Min=3756, Avg=8560.16, 90=10543, 99=12639, 99.9=14511, 99.99=15759] 
2018-12-29 14:52:40:642 300 sec: 3687048 operations; 12717.9 current ops/sec; est completion in 8 minutes [READ: Count=120863, Max=32319, Min=2486, Avg=7838.57, 90=9935, 99=18159, 99.9=23807, 99.99=28495] [INSERT: Count=6312, Max=16703, Min=3142, Avg=8277.31, 90=10287, 99=12759, 99.9=14527, 99.99=15135] 
2018-12-29 14:52:50:642 310 sec: 3809128 operations; 12208 current ops/sec; est completion in 8 minutes [READ: Count=115975, Max=41727, Min=2824, Avg=8169.62, 90=10607, 99=18911, 99.9=26207, 99.99=31695] [INSERT: Count=6102, Max=19631, Min=4284, Avg=8592.52, 90=10815, 99=13543, 99.9=16111, 99.99=17599] 
2018-12-29 14:53:00:642 320 sec: 3931626 operations; 12249.8 current ops/sec; est completion in 8 minutes [READ: Count=116341, Max=36319, Min=2536, Avg=8140.89, 90=10511, 99=18847, 99.9=25375, 99.99=30095] [INSERT: Count=6157, Max=17679, Min=3638, Avg=8563.32, 90=10767, 99=13151, 99.9=14815, 99.99=16511] 
2018-12-29 14:53:10:642 330 sec: 4056493 operations; 12486.7 current ops/sec; est completion in 8 minutes [READ: Count=118564, Max=33855, Min=2312, Avg=7987.16, 90=10159, 99=18399, 99.9=24383, 99.99=28863] [INSERT: Count=6303, Max=17039, Min=4152, Avg=8373.22, 90=10367, 99=12607, 99.9=14335, 99.99=15823] 
2018-12-29 14:53:20:642 340 sec: 4178707 operations; 12221.4 current ops/sec; est completion in 7 minutes [READ: Count=116016, Max=34975, Min=2734, Avg=8159.93, 90=10375, 99=18671, 99.9=24655, 99.99=28943] [INSERT: Count=6205, Max=18319, Min=3844, Avg=8568.03, 90=10599, 99=13055, 99.9=15279, 99.99=16783] 
2018-12-29 14:53:30:642 350 sec: 4302830 operations; 12412.3 current ops/sec; est completion in 7 minutes [READ: Count=118026, Max=32479, Min=2872, Avg=8036.52, 90=10087, 99=18495, 99.9=24031, 99.99=28335] [INSERT: Count=6098, Max=15871, Min=3906, Avg=8417.18, 90=10279, 99=12335, 99.9=14391, 99.99=15367] 
2018-12-29 14:53:40:642 360 sec: 4422938 operations; 12010.8 current ops/sec; est completion in 7 minutes [READ: Count=114045, Max=35807, Min=3072, Avg=8306.68, 90=10575, 99=18991, 99.9=25343, 99.99=29599] [INSERT: Count=6056, Max=17743, Min=4056, Avg=8663.5, 90=10607, 99=12903, 99.9=15015, 99.99=16991] 
2018-12-29 14:53:50:643 370 sec: 4545442 operations; 12250.4 current ops/sec; est completion in 7 minutes [READ: Count=116487, Max=36127, Min=2574, Avg=8141.9, 90=10327, 99=18479, 99.9=24479, 99.99=29727] [INSERT: Count=6020, Max=17375, Min=3832, Avg=8544.82, 90=10535, 99=12951, 99.9=15543, 99.99=16591] 
2018-12-29 14:54:00:642 380 sec: 4674241 operations; 12879.9 current ops/sec; est completion in 7 minutes [READ: Count=122384, Max=33151, Min=2740, Avg=7740.8, 90=9751, 99=17791, 99.9=23199, 99.99=28159] [INSERT: Count=6419, Max=15575, Min=3904, Avg=8168.24, 90=10023, 99=12151, 99.9=13615, 99.99=14543] 
2018-12-29 14:54:10:642 390 sec: 4799290 operations; 12504.9 current ops/sec; est completion in 7 minutes [READ: Count=118661, Max=33951, Min=2738, Avg=7974.07, 90=10151, 99=18415, 99.9=24239, 99.99=28687] [INSERT: Count=6384, Max=18527, Min=4192, Avg=8398.43, 90=10423, 99=13007, 99.9=16263, 99.99=17935] 
2018-12-29 14:54:20:642 400 sec: 4923550 operations; 12426 current ops/sec; est completion in 6 minutes [READ: Count=117941, Max=90687, Min=2538, Avg=8027.13, 90=10327, 99=18559, 99.9=27103, 99.99=61887] [INSERT: Count=6320, Max=18143, Min=3842, Avg=8397.78, 90=10431, 99=13327, 99.9=15783, 99.99=17951] 
2018-12-29 14:54:30:642 410 sec: 5051048 operations; 12749.8 current ops/sec; est completion in 6 minutes [READ: Count=120978, Max=35135, Min=2828, Avg=7818.27, 90=9855, 99=18095, 99.9=23791, 99.99=29343] [INSERT: Count=6516, Max=16031, Min=3836, Avg=8268.37, 90=10191, 99=12399, 99.9=14487, 99.99=15863] 
2018-12-29 14:54:40:643 420 sec: 5176206 operations; 12515.8 current ops/sec; est completion in 6 minutes [READ: Count=118882, Max=31247, Min=2860, Avg=7965.19, 90=10023, 99=18223, 99.9=24015, 99.99=27919] [INSERT: Count=6275, Max=17023, Min=3710, Avg=8447.22, 90=10359, 99=12711, 99.9=14903, 99.99=16335] 
2018-12-29 14:54:50:642 430 sec: 5300636 operations; 12443 current ops/sec; est completion in 6 minutes [READ: Count=118149, Max=33535, Min=2262, Avg=8014.32, 90=10111, 99=18335, 99.9=24127, 99.99=28031] [INSERT: Count=6281, Max=16175, Min=4220, Avg=8431.04, 90=10391, 99=12615, 99.9=15039, 99.99=16079] 
2018-12-29 14:55:00:642 440 sec: 5421907 operations; 12127.1 current ops/sec; est completion in 6 minutes [READ: Count=115276, Max=36287, Min=2642, Avg=8222.02, 90=10447, 99=18783, 99.9=24799, 99.99=29103] [INSERT: Count=6010, Max=16031, Min=2652, Avg=8637.36, 90=10735, 99=13319, 99.9=15047, 99.99=15799] 
2018-12-29 14:55:10:642 450 sec: 5542542 operations; 12063.5 current ops/sec; est completion in 6 minutes [READ: Count=114595, Max=37919, Min=3240, Avg=8269.37, 90=10623, 99=18751, 99.9=25055, 99.99=30127] [INSERT: Count=6029, Max=17951, Min=4112, Avg=8655.5, 90=10751, 99=13079, 99.9=15279, 99.99=15919] 
2018-12-29 14:55:20:643 460 sec: 5667716 operations; 12517.4 current ops/sec; est completion in 5 minutes [READ: Count=119017, Max=33983, Min=2812, Avg=7960.55, 90=10015, 99=18207, 99.9=24015, 99.99=28575] [INSERT: Count=6153, Max=16039, Min=4004, Avg=8455.6, 90=10399, 99=12663, 99.9=14887, 99.99=15975] 
2018-12-29 14:55:30:642 470 sec: 5790353 operations; 12263.7 current ops/sec; est completion in 5 minutes [READ: Count=116461, Max=37407, Min=3082, Avg=8135.49, 90=10295, 99=18511, 99.9=25007, 99.99=31151] [INSERT: Count=6180, Max=17967, Min=3670, Avg=8537.06, 90=10543, 99=13231, 99.9=16319, 99.99=17679] 
2018-12-29 14:55:40:642 480 sec: 5913932 operations; 12357.9 current ops/sec; est completion in 5 minutes [READ: Count=117499, Max=34111, Min=2806, Avg=8070.06, 90=10263, 99=18223, 99.9=24463, 99.99=29775] [INSERT: Count=6087, Max=16463, Min=3752, Avg=8473.02, 90=10455, 99=12839, 99.9=14599, 99.99=16255] 
2018-12-29 14:55:50:642 490 sec: 6035116 operations; 12118.4 current ops/sec; est completion in 5 minutes [READ: Count=115141, Max=35743, Min=2710, Avg=8231.24, 90=10535, 99=18543, 99.9=24783, 99.99=29103] [INSERT: Count=6033, Max=16135, Min=3632, Avg=8621.67, 90=10703, 99=13071, 99.9=15055, 99.99=15623] 
2018-12-29 14:56:00:642 500 sec: 6154543 operations; 11942.7 current ops/sec; est completion in 5 minutes [READ: Count=113676, Max=34495, Min=3058, Avg=8352, 90=10591, 99=19103, 99.9=25359, 99.99=29631] [INSERT: Count=5762, Max=15527, Min=3744, Avg=8749.7, 90=10759, 99=12775, 99.9=14887, 99.99=15439] 
2018-12-29 14:56:10:643 510 sec: 6277310 operations; 12276.7 current ops/sec; est completion in 5 minutes [READ: Count=116715, Max=75839, Min=2700, Avg=8123.59, 90=10287, 99=18815, 99.9=26911, 99.99=43263] [INSERT: Count=6048, Max=16159, Min=3854, Avg=8540.15, 90=10511, 99=12831, 99.9=14639, 99.99=15479] 
2018-12-29 14:56:20:642 520 sec: 6401792 operations; 12448.2 current ops/sec; est completion in 4 minutes [READ: Count=118270, Max=37343, Min=2590, Avg=8012.2, 90=10079, 99=18111, 99.9=24223, 99.99=28303] [INSERT: Count=6206, Max=15463, Min=4164, Avg=8412.12, 90=10335, 99=12319, 99.9=14263, 99.99=14999] 
2018-12-29 14:56:30:642 530 sec: 6522104 operations; 12031.2 current ops/sec; est completion in 4 minutes [READ: Count=114315, Max=37055, Min=3064, Avg=8286.44, 90=10639, 99=18751, 99.9=25343, 99.99=30687] [INSERT: Count=5995, Max=18495, Min=3962, Avg=8735.02, 90=10951, 99=13711, 99.9=16111, 99.99=18399] 
2018-12-29 14:56:40:642 540 sec: 6644592 operations; 12248.8 current ops/sec; est completion in 4 minutes [READ: Count=116319, Max=36287, Min=2984, Avg=8141.21, 90=10407, 99=18399, 99.9=24767, 99.99=30047] [INSERT: Count=6170, Max=17871, Min=3926, Avg=8591.18, 90=10615, 99=13255, 99.9=15783, 99.99=17823] 
2018-12-29 14:56:50:642 550 sec: 6766691 operations; 12209.9 current ops/sec; est completion in 4 minutes [READ: Count=115972, Max=33823, Min=3026, Avg=8163.21, 90=10439, 99=18447, 99.9=24767, 99.99=30303] [INSERT: Count=6128, Max=16623, Min=4408, Avg=8655.32, 90=10799, 99=13159, 99.9=14687, 99.99=15671] 
2018-12-29 14:57:00:643 560 sec: 6889250 operations; 12255.9 current ops/sec; est completion in 4 minutes [READ: Count=116419, Max=34719, Min=2822, Avg=8134.93, 90=10287, 99=18479, 99.9=24783, 99.99=29263] [INSERT: Count=6139, Max=16223, Min=3754, Avg=8589.34, 90=10607, 99=12727, 99.9=14423, 99.99=15607] 
2018-12-29 14:57:10:643 570 sec: 7014016 operations; 12476.6 current ops/sec; est completion in 4 minutes [READ: Count=118499, Max=36095, Min=2590, Avg=7993, 90=10327, 99=18207, 99.9=24975, 99.99=30207] [INSERT: Count=6276, Max=16543, Min=4268, Avg=8416.87, 90=10543, 99=13183, 99.9=15239, 99.99=15991] 
2018-12-29 14:57:20:642 580 sec: 7137380 operations; 12336.4 current ops/sec; est completion in 3 minutes [READ: Count=117190, Max=32895, Min=2858, Avg=8081.08, 90=10311, 99=18335, 99.9=25039, 99.99=29215] [INSERT: Count=6168, Max=16415, Min=4380, Avg=8552.63, 90=10647, 99=13151, 99.9=14671, 99.99=16015] 
2018-12-29 14:57:30:642 590 sec: 7260066 operations; 12268.6 current ops/sec; est completion in 3 minutes [READ: Count=116530, Max=38527, Min=2668, Avg=8128.93, 90=10447, 99=18431, 99.9=25263, 99.99=31023] [INSERT: Count=6152, Max=16911, Min=3994, Avg=8537.72, 90=10599, 99=13167, 99.9=15167, 99.99=15959] 
2018-12-29 14:57:40:642 600 sec: 7383138 operations; 12307.2 current ops/sec; est completion in 3 minutes [READ: Count=116968, Max=38111, Min=2590, Avg=8100.3, 90=10303, 99=18287, 99.9=23823, 99.99=28815] [INSERT: Count=6107, Max=15759, Min=4524, Avg=8558.18, 90=10551, 99=13095, 99.9=14983, 99.99=15743] 
2018-12-29 14:57:50:642 610 sec: 7507024 operations; 12388.6 current ops/sec; est completion in 3 minutes [READ: Count=117692, Max=34111, Min=3004, Avg=8049.68, 90=10223, 99=18271, 99.9=24671, 99.99=30735] [INSERT: Count=6192, Max=15791, Min=4164, Avg=8461.65, 90=10415, 99=12919, 99.9=14871, 99.99=15711] 
2018-12-29 14:58:00:642 620 sec: 7629224 operations; 12220 current ops/sec; est completion in 3 minutes [READ: Count=116121, Max=39455, Min=2664, Avg=8156.94, 90=10351, 99=18399, 99.9=24175, 99.99=29103] [INSERT: Count=6078, Max=17167, Min=4256, Avg=8649, 90=10695, 99=13175, 99.9=15319, 99.99=16911] 
2018-12-29 14:58:10:642 630 sec: 7752518 operations; 12329.4 current ops/sec; est completion in 3 minutes [READ: Count=117258, Max=31519, Min=2442, Avg=8089.45, 90=10351, 99=18207, 99.9=24559, 99.99=28975] [INSERT: Count=6036, Max=15895, Min=4368, Avg=8528.86, 90=10631, 99=12903, 99.9=14903, 99.99=15663] 
2018-12-29 14:58:20:643 640 sec: 7876236 operations; 12371.8 current ops/sec; est completion in 2 minutes [READ: Count=117497, Max=38367, Min=2332, Avg=8055.48, 90=10199, 99=18287, 99.9=24719, 99.99=30207] [INSERT: Count=6223, Max=17487, Min=2730, Avg=8541.11, 90=10527, 99=12847, 99.9=15767, 99.99=15959] 
2018-12-29 14:58:30:642 650 sec: 7998535 operations; 12229.9 current ops/sec; est completion in 2 minutes [READ: Count=116160, Max=34847, Min=2802, Avg=8155.35, 90=10423, 99=18255, 99.9=25071, 99.99=29519] [INSERT: Count=6137, Max=17583, Min=3592, Avg=8584.34, 90=10655, 99=12975, 99.9=14847, 99.99=17071] 
2018-12-29 14:58:40:642 660 sec: 8119099 operations; 12056.4 current ops/sec; est completion in 2 minutes [READ: Count=114406, Max=34463, Min=3076, Avg=8270.3, 90=10639, 99=18735, 99.9=25983, 99.99=30847] [INSERT: Count=6159, Max=16079, Min=3684, Avg=8671.18, 90=10767, 99=13255, 99.9=14975, 99.99=15503] 
2018-12-29 14:58:50:642 670 sec: 8239795 operations; 12069.6 current ops/sec; est completion in 2 minutes [READ: Count=114716, Max=34815, Min=2588, Avg=8263.79, 90=10671, 99=18735, 99.9=25711, 99.99=30735] [INSERT: Count=5979, Max=16799, Min=3596, Avg=8668.95, 90=10767, 99=13431, 99.9=15431, 99.99=16719] 
2018-12-29 14:59:00:642 680 sec: 8359446 operations; 11965.1 current ops/sec; est completion in 2 minutes [READ: Count=113646, Max=100287, Min=2698, Avg=8336.48, 90=10871, 99=18895, 99.9=27999, 99.99=64927] [INSERT: Count=6011, Max=18015, Min=3940, Avg=8741.98, 90=10919, 99=13791, 99.9=16119, 99.99=17391] 
2018-12-29 14:59:10:642 690 sec: 8483103 operations; 12365.7 current ops/sec; est completion in 2 minutes [READ: Count=117439, Max=36351, Min=2818, Avg=8058.96, 90=10263, 99=17935, 99.9=23999, 99.99=30015] [INSERT: Count=6213, Max=18703, Min=4020, Avg=8568.46, 90=10607, 99=13039, 99.9=16623, 99.99=18607] 
2018-12-29 14:59:20:642 700 sec: 8607321 operations; 12421.8 current ops/sec; est completion in 1 minute [READ: Count=118035, Max=37439, Min=2584, Avg=8027.97, 90=10287, 99=18303, 99.9=24351, 99.99=30527] [INSERT: Count=6183, Max=16751, Min=3678, Avg=8450.37, 90=10431, 99=13007, 99.9=15007, 99.99=16751] 
2018-12-29 14:59:30:642 710 sec: 8729668 operations; 12234.7 current ops/sec; est completion in 1 minute [READ: Count=116220, Max=36191, Min=2914, Avg=8151.05, 90=10287, 99=18399, 99.9=24591, 99.99=29199] [INSERT: Count=6129, Max=16511, Min=3950, Avg=8583.13, 90=10583, 99=12719, 99.9=14815, 99.99=15207] 
2018-12-29 14:59:40:642 720 sec: 8853055 operations; 12338.7 current ops/sec; est completion in 1 minute [READ: Count=117340, Max=35775, Min=3142, Avg=8079.43, 90=10311, 99=18175, 99.9=24639, 99.99=29391] [INSERT: Count=6056, Max=15263, Min=4240, Avg=8528.66, 90=10551, 99=13111, 99.9=14671, 99.99=15191] 
2018-12-29 14:59:50:642 730 sec: 8975460 operations; 12240.5 current ops/sec; est completion in 1 minute [READ: Count=116277, Max=34783, Min=2318, Avg=8144.71, 90=10327, 99=18319, 99.9=24223, 99.99=28591] [INSERT: Count=6117, Max=17151, Min=3562, Avg=8611.79, 90=10639, 99=12775, 99.9=15687, 99.99=16183] 
2018-12-29 15:00:00:642 740 sec: 9096529 operations; 12106.9 current ops/sec; est completion in 1 minute [READ: Count=115204, Max=34047, Min=2534, Avg=8238.71, 90=10367, 99=18719, 99.9=24767, 99.99=29263] [INSERT: Count=5877, Max=17535, Min=4524, Avg=8674.01, 90=10591, 99=12703, 99.9=14775, 99.99=15415] 
2018-12-29 15:00:10:642 750 sec: 9217554 operations; 12102.5 current ops/sec; est completion in 1 minute [READ: Count=115034, Max=135551, Min=1071, Avg=8246.15, 90=10471, 99=18735, 99.9=27247, 99.99=98495] [INSERT: Count=5978, Max=17551, Min=2500, Avg=8565.2, 90=10519, 99=12759, 99.9=14831, 99.99=17343] 
2018-12-29 15:00:20:642 760 sec: 9343489 operations; 12593.5 current ops/sec; est completion in 54 seconds [READ: Count=119656, Max=34495, Min=2830, Avg=7914.59, 90=9999, 99=17967, 99.9=23567, 99.99=28575] [INSERT: Count=6289, Max=16799, Min=3560, Avg=8373.2, 90=10327, 99=12615, 99.9=15007, 99.99=16559] 
2018-12-29 15:00:30:642 770 sec: 9467780 operations; 12429.1 current ops/sec; est completion in 44 seconds [READ: Count=117944, Max=34335, Min=2628, Avg=8018.11, 90=10191, 99=17999, 99.9=23919, 99.99=30127] [INSERT: Count=6337, Max=17663, Min=3896, Avg=8533.89, 90=10551, 99=13159, 99.9=14839, 99.99=15423] 
2018-12-29 15:00:40:642 780 sec: 9590236 operations; 12245.6 current ops/sec; est completion in 34 seconds [READ: Count=116453, Max=33983, Min=2768, Avg=8142.52, 90=10479, 99=18159, 99.9=24495, 99.99=29983] [INSERT: Count=6012, Max=17055, Min=3910, Avg=8629.75, 90=10807, 99=13543, 99.9=15199, 99.99=16719] 
2018-12-29 15:00:50:642 790 sec: 9712476 operations; 12224 current ops/sec; est completion in 24 seconds [READ: Count=116217, Max=36895, Min=1792, Avg=8154.87, 90=10423, 99=18159, 99.9=24287, 99.99=29903] [INSERT: Count=6014, Max=17471, Min=3784, Avg=8617.11, 90=10719, 99=13135, 99.9=15327, 99.99=16735] 
2018-12-29 15:01:00:642 800 sec: 9835327 operations; 12285.1 current ops/sec; est completion in 14 seconds [READ: Count=116648, Max=33919, Min=3076, Avg=8112.65, 90=10367, 99=18175, 99.9=24703, 99.99=29775] [INSERT: Count=6209, Max=17743, Min=3618, Avg=8615.3, 90=10695, 99=13487, 99.9=15407, 99.99=16719] 
2018-12-29 15:01:10:642 810 sec: 9956873 operations; 12154.6 current ops/sec; est completion in 4 second [READ: Count=115481, Max=35231, Min=2554, Avg=8204.74, 90=10479, 99=18239, 99.9=24671, 99.99=29503] [INSERT: Count=6059, Max=14951, Min=3674, Avg=8630.99, 90=10735, 99=12999, 99.9=14423, 99.99=14919] 
2018-12-29 15:01:16:675 816 sec: 10000000 operations; 7148.52 current ops/sec; [READ: Count=40996, Max=33183, Min=564, Avg=7428.4, 90=10167, 99=17295, 99.9=24479, 99.99=30991] [CLEANUP: Count=100, Max=2217983, Min=0, Avg=22171.23, 90=3, 99=65, 99.9=2217983, 99.99=2217983] [INSERT: Count=2131, Max=16991, Min=972, Avg=7862.51, 90=10351, 99=13775, 99.9=15239, 99.99=16991] 
[OVERALL], RunTime(ms), 816032
[OVERALL], Throughput(ops/sec), 12254.421395239402
[TOTAL_GCS_PS_Scavenge], Count, 1014
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1644
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.20146268773773576
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1014
[TOTAL_GC_TIME], Time(ms), 1644
[TOTAL_GC_TIME_%], Time(%), 0.20146268773773576
[READ], Operations, 9500693
[READ], AverageLatency(us), 8104.333127278189
[READ], MinLatency(us), 564
[READ], MaxLatency(us), 135551
[READ], 95thPercentileLatency(us), 11559
[READ], 99thPercentileLatency(us), 18559
[READ], Return=OK, 9500693
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 22171.23
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 2217983
[CLEANUP], 95thPercentileLatency(us), 3
[CLEANUP], 99thPercentileLatency(us), 65
[INSERT], Operations, 499307
[INSERT], AverageLatency(us), 8518.955159851554
[INSERT], MinLatency(us), 972
[INSERT], MaxLatency(us), 78783
[INSERT], 95thPercentileLatency(us), 11335
[INSERT], 99thPercentileLatency(us), 12983
[INSERT], Return=OK, 499307